espressif/esp-rainmaker-neo-firmware/test/sims/device-sim/sdkconfig.defaults.esp32c2
# ESP32C2-specific configuration.

CONFIG_IDF_TARGET="esp32c2"

# Most ESP32C2 kits use a 26MHz crystal; remove this option if using 40MHz
CONFIG_XTAL_FREQ_26=y
# Follow the default baudrate of 74880 with 26MHz crystal
CONFIG_ESP_CONSOLE_UART_BAUDRATE=74880
CONFIG_OSAL_EXT_IO_ESP_UART_BAUD_RATE=74880

## ESP32C2 chips are very RAM constrained; some ways to minimize RAM usage
## These are ordered in ascending level of impact to performance; slowly uncomment as needed

# Turn off unnecessary peripherals
CONFIG_WS_TRANSPORT=n
CONFIG_ETH_USE_SPI_ETHERNET=n
CONFIG_VFS_SUPPORT_DIR=n
CONFIG_VFS_SUPPORT_SELECT=n
CONFIG_VFS_SUPPORT_TERMIOS=n

# Switch mbedTLS buffers to dynamic
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# Move functions into flash whenever possible
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=n
CONFIG_SPI_SLAVE_ISR_IN_IRAM=n

# Reduce stack and queue sizes
CONFIG_ESP_TIMER_TASK_STACK_SIZE=2048
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=16
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2048
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3072

# Reduce Wi-Fi heap usage
# NOTE: these options will drastically reduce Wi-Fi performance, use as a last resort
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=12
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
